Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 128, 6, 16)        160       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 42, 2, 16)         0         
_________________________________________________________________
batch_normalization (BatchNo (None, 42, 2, 16)         64        
_________________________________________________________________
dropout (Dropout)            (None, 42, 2, 16)         0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 42, 2, 32)         4640      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 14, 2, 32)         0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 14, 2, 32)         0         
_________________________________________________________________
global_average_pooling2d (Gl (None, 32)                0         
_________________________________________________________________
dense (Dense)                (None, 16)                528       
_________________________________________________________________
dropout_2 (Dropout)          (None, 16)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 4)                 68        
=================================================================
Total params: 5,460
Trainable params: 5,428
Non-trainable params: 32
_________________________________________________________________
